-- MySQL dump 10.13  Distrib 5.7.20, for Linux (x86_64)
--
-- Host: localhost    Database: schoolsort
-- ------------------------------------------------------
-- Server version	5.7.20-0ubuntu0.16.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `schoolsort`
--
# crawel school sort;
drop DATABASE if EXISTS schoolsort;
CREATE DATABASE schoolsort charset=utf8;
use schoolsort;

DROP TABLE IF EXISTS `schoolsort`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `schoolsort` (
  `id` int(10) NOT NULL COMMENT 'id',
  `rank` int(10) NOT NULL COMMENT '名次',
  `college_id` int(10) NOT NULL COMMENT '学校id',
  `city` varchar(20) NOT NULL COMMENT '名次',
  `subject_a` int(10) NOT NULL COMMENT '世界排名前%1学科数',
  `work_rank` int(10) NOT NULL COMMENT '世界排名',
  `sci` int(10) NOT NULL COMMENT 'sci论文数',
  `name` varchar(20) NOT NULL COMMENT '院校名称',
  PRIMARY KEY (`id`),
  UNIQUE KEY `college_id` (`college_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `schoolsort`
--

LOCK TABLES `schoolsort` WRITE;
/*!40000 ALTER TABLE `schoolsort` DISABLE KEYS */;
INSERT INTO `schoolsort` VALUES (1,1,1,'北京',21,124,58411,'北京大学'),(2,2,6,'浙江',18,141,67328,'浙江大学'),(3,3,2,'北京',16,143,59057,'清华大学'),(4,4,3,'上海',17,162,63343,'上海交通大学'),(5,5,4,'上海',17,187,44218,'复旦大学'),(6,6,14,'安徽',10,234,35402,'中国科学技术大学'),(7,7,8,'江苏',16,240,38379,'南京大学'),(8,8,10,'广东',18,258,37986,'中山大学'),(9,9,2051,'北京',15,307,44801,'中国科学院大学'),(10,10,16,'山东',16,348,36663,'山东大学'),(11,11,9,'吉林',10,378,33945,'吉林大学'),(12,12,13,'四川',14,379,37523,'四川大学'),(13,13,12,'湖北',15,381,36914,'华中科技大学'),(14,14,15,'天津',10,419,20347,'南开大学'),(15,15,5,'湖北',16,420,27214,'武汉大学'),(16,16,20,'黑龙江',8,435,32785,'哈尔滨工业大学'),(17,17,30,'辽宁',8,459,24578,'大连理工大学'),(18,18,18,'陕西',12,470,31158,'西安交通大学'),(19,19,31,'北京',11,476,19518,'北京协和医学院'),(20,20,27,'广东',7,496,20782,'华南理工大学'),(21,21,17,'湖南',11,497,28247,'中南大学'),(22,22,19,'福建',11,515,18968,'厦门大学'),(23,23,38,'甘肃',12,517,18580,'兰州大学'),(24,24,51,'江苏',8,531,19848,'苏州大学'),(25,25,25,'江苏',10,537,23935,'东南大学'),(26,26,41,'上海',5,545,16290,'华东理工大学'),(27,27,23,'天津',6,552,23311,'天津大学'),(28,28,22,'上海',8,556,24540,'同济大学'),(29,29,11,'北京',13,602,17681,'北京师范大学'),(30,30,26,'北京',9,637,16822,'中国农业大学'),(31,31,28,'湖南',8,702,13543,'湖南大学'),(32,32,24,'上海',10,745,13038,'华东师范大学'),(33,33,77,'北京',5,773,15741,'首都医科大学'),(34,34,61,'北京',4,794,10801,'北京化工大学'),(35,35,71,'上海',8,795,14359,'上海大学'),(36,36,21,'北京',5,829,18716,'北京航空航天大学'),(37,37,718,'湖北',5,837,13300,'中国地质大学(武汉)'),(38,38,709,'上海',7,838,10913,'中国人民解放军第二军医大学'),(39,39,106,'江苏',5,845,12885,'南京医科大学'),(40,40,32,'北京',4,849,14959,'北京理工大学'),(41,41,710,'陕西',6,902,9970,'解放军第四军医大学'),(42,42,39,'北京',3,931,14444,'北京科技大学'),(43,43,40,'吉林',4,944,7655,'东北师范大学'),(44,44,46,'江苏',7,951,10556,'南京农业大学'),(45,45,62,'河南',4,968,13588,'郑州大学'),(46,46,33,'重庆',4,988,14907,'重庆大学'),(47,47,36,'湖北',4,990,7000,'华中师范大学'),(48,48,49,'湖北',3,992,8124,'武汉理工大学'),(49,49,42,'四川',6,995,15938,'电子科技大学'),(50,50,75,'福建',3,997,6940,'福州大学'),(51,51,47,'山东',9,1002,10605,'中国海洋大学'),(52,52,44,'湖北',6,1006,9233,'华中农业大学'),(53,53,80,'上海',3,1047,7677,'东华大学'),(54,54,79,'江苏',5,1083,10147,'江南大学'),(55,55,29,'陕西',3,1106,14365,'西北工业大学'),(56,56,50,'重庆',6,1121,9394,'西南大学'),(57,57,48,'江苏',4,1153,10229,'南京理工大学'),(58,58,2063,'重庆',5,1156,8124,'解放军第三军医大学'),(59,59,112,'辽宁',4,1159,9203,'中国医科大学'),(60,60,56,'江苏',4,1171,10078,'南京航空航天大学'),(61,61,37,'陕西',4,1172,7240,'西北大学'),(62,62,34,'辽宁',4,1187,11488,'东北大学'),(63,63,108,'江苏',3,1194,7957,'南京工业大学'),(64,64,116,'江苏',5,1199,10054,'江苏大学'),(65,65,101,'黑龙江',4,1206,7850,'哈尔滨医科大学'),(66,66,52,'陕西',6,1211,10182,'西北农林科技大学'),(67,67,103,'广东',3,1220,8681,'南方医科大学'),(68,68,68,'广东',5,1238,8234,'华南师范大学'),(69,69,717,'北京',4,1246,11184,'中国石油大学(北京)'),(70,70,60,'广东',7,1257,8773,'暨南大学'),(71,71,120,'天津',4,1304,6664,'天津医科大学'),(72,72,124,'江苏',3,1321,6990,'中国药科大学'),(73,73,53,'江苏',4,1325,7072,'南京师范大学'),(74,74,90,'浙江',4,1344,7682,'浙江工业大学'),(75,75,76,'江西',5,1371,7783,'南昌大学'),(76,76,109,'江苏',5,1373,6568,'扬州大学'),(77,77,74,'北京',3,1402,8201,'北京工业大学'),(78,78,125,'重庆',2,1417,6705,'重庆医科大学'),(79,79,63,'陕西',2,1440,10538,'西安电子科技大学'),(80,80,183,'浙江',3,1467,6684,'温州医科大学'),(81,81,55,'黑龙江',3,1502,5467,'哈尔滨工程大学'),(82,82,82,'广东',2,1521,6024,'华南农业大学'),(83,83,66,'安徽',3,1528,6183,'合肥工业大学'),(84,84,69,'陕西',4,1543,6414,'陕西师范大学'),(85,85,218,'山东',4,1544,6124,'济南大学'),(86,86,100,'湖南',3,1562,5130,'湘潭大学'),(87,87,708,'湖南',4,1571,9692,'中国人民解放军国防科学技术大学'),(88,88,113,'浙江',4,1594,5090,'浙江师范大学'),(89,89,216,'辽宁',3,1601,4551,'沈阳药科大学'),(90,90,45,'北京',3,1602,8523,'北京交通大学'),(91,91,152,'山东',3,1603,5931,'青岛大学'),(92,92,169,'安徽',2,1617,5339,'安徽医科大学'),(93,93,126,'上海',3,1629,4031,'上海师范大学'),(94,94,173,'山东',3,1656,4432,'青岛科技大学'),(95,95,54,'云南',3,1687,5190,'云南大学'),(96,96,193,'广东',2,1690,3624,'汕头大学'),(97,97,58,'湖南',2,1695,4562,'湖南师范大学'),(98,98,98,'江苏',4,1700,8054,'中国矿业大学(徐州)'),(99,99,164,'河南',2,1722,5002,'河南师范大学'),(100,100,73,'山西',2,1745,5070,'山西大学'),(101,101,95,'广东',3,1754,5997,'深圳大学'),(102,102,59,'四川',3,1764,6414,'西南交通大学'),(103,103,175,'浙江',1,1795,4333,'杭州师范大学'),(104,104,721,'北京',1,1804,5511,'华北电力大学(北京)'),(105,105,87,'河南',2,1810,5044,'河南大学'),(106,106,160,'浙江',4,1813,5640,'宁波大学'),(107,107,86,'安徽',3,1828,4866,'安徽大学'),(108,108,7,'北京',2,1852,4206,'中国人民大学'),(109,109,130,'安徽',1,1854,3080,'安徽师范大学'),(110,110,67,'北京',3,1878,7123,'北京邮电大学'),(111,111,96,'广西',3,1904,5064,'广西大学'),(112,112,165,'浙江',3,1905,3773,'浙江理工大学'),(113,113,184,'江苏',3,1910,3741,'南京邮电大学'),(114,114,84,'北京',2,1915,4620,'首都师范大学'),(115,115,64,'北京',3,1934,4846,'北京林业大学'),(116,116,123,'山东',2,1965,3907,'山东农业大学'),(117,117,221,'广东',1,1974,4365,'广州医科大学'),(118,118,229,'江苏',2,2015,4549,'南通大学'),(119,119,57,'江苏',2,2028,6289,'河海大学'),(120,120,205,'辽宁',2,2047,3634,'大连医科大学'),(121,121,161,'河北',1,2051,3843,'河北医科大学'),(122,122,110,'河北',2,2061,5202,'燕山大学'),(123,123,105,'河北',1,2124,4251,'河北大学'),(124,124,131,'湖北',2,2125,3150,'湖北大学'),(125,125,247,'浙江',2,2147,3032,'温州大学'),(126,126,89,'黑龙江',3,2184,3578,'东北林业大学'),(127,127,128,'甘肃',1,2190,3812,'西北师范大学'),(128,128,102,'黑龙江',3,2203,2774,'黑龙江大学'),(129,129,214,'江苏',2,2211,4843,'南京信息工程大学'),(130,130,83,'山西',3,2218,5065,'太原理工大学'),(131,131,119,'山东',1,2221,3451,'山东师范大学'),(132,132,254,'福建',1,2224,3617,'福建医科大学'),(133,133,215,'江苏',1,2263,3309,'江苏师范大学'),(134,134,107,'云南',2,2271,4853,'昆明理工大学'),(135,135,148,'河北',1,2273,2999,'河北师范大学'),(136,136,202,'广东',1,2284,4075,'广东工业大学'),(137,137,138,'江西',1,2288,3100,'江西师范大学'),(138,138,117,'四川',2,2295,3912,'四川农业大学'),(139,139,227,'广西',1,2299,3168,'广西医科大学'),(140,140,167,'广西',1,2307,2811,'广西师范大学'),(141,141,91,'福建',1,2334,3456,'福建师范大学'),(142,142,177,'福建',2,2359,2587,'华侨大学'),(143,143,274,'山东',1,2401,3169,'聊城大学'),(144,144,136,'上海',2,2407,2888,'上海中医药大学'),(145,145,85,'新疆',1,2423,3094,'新疆大学'),(146,146,172,'天津',2,2437,3602,'天津工业大学'),(147,147,191,'江苏',2,2449,2952,'南京中医药大学'),(148,148,265,'江苏',2,2459,3103,'常州大学'),(149,149,208,'山东',2,2493,2904,'曲阜师范大学'),(150,150,235,'天津',1,2495,2981,'天津科技大学'),(151,151,137,'天津',1,2503,2171,'天津师范大学'),(152,152,122,'上海',1,2511,3957,'上海理工大学'),(153,153,186,'辽宁',1,2529,2694,'辽宁师范大学'),(154,154,97,'贵州',1,2590,2914,'贵州大学'),(155,155,248,'湖南',1,2612,2164,'南华大学'),(156,156,226,'湖北',1,2618,1955,'中南民族大学'),(157,157,114,'天津',3,2625,3104,'河北工业大学'),(158,158,118,'黑龙江',2,2627,2987,'东北农业大学'),(159,159,271,'浙江',1,2653,3047,'中国计量大学'),(160,160,219,'安徽',2,2704,2065,'安徽工业大学'),(161,161,282,'河北',1,2729,1788,'华北理工大学'),(162,162,230,'上海',1,2796,2456,'上海海洋大学'),(163,163,344,'广东',1,2808,2144,'广东医科大学'),(164,164,134,'湖南',2,2825,2058,'湖南农业大学'),(165,165,141,'辽宁',1,2848,2288,'大连海事大学'),(166,166,81,'辽宁',1,2871,1933,'辽宁大学'),(167,167,133,'吉林',1,2904,2034,'延边大学'),(168,168,225,'浙江',1,2908,2941,'杭州电子科技大学'),(169,169,290,'云南',1,2924,2222,'昆明医科大学'),(170,170,357,'辽宁',1,2927,1745,'渤海大学'),(171,171,163,'甘肃',2,2952,2260,'兰州理工大学'),(172,172,194,'浙江',1,2994,2281,'浙江工商大学'),(173,173,139,'湖北',1,2995,2561,'武汉科技大学'),(174,174,151,'湖南',1,3013,2395,'长沙理工大学'),(175,175,321,'江苏',1,3037,2282,'徐州医科大学'),(176,176,99,'北京',1,3073,2453,'北京中医药大学'),(177,177,144,'福建',1,3080,2355,'福建农林大学'),(178,178,162,'河南',1,3089,2656,'河南理工大学'),(179,179,153,'四川',1,3097,2218,'成都理工大学'),(180,180,239,'山西',1,3121,1779,'山西医科大学');
/*!40000 ALTER TABLE `schoolsort` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-11-22 22:01:33
